Revit 2027 API
WireType.Insulation Property
 The conductor insulation material of the wire type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Insulation { get; set; }
Public Property Insulation As ElementId
	Get
	Set
public:
property ElementId^ Insulation {
	ElementId^ get ();
	void set (ElementId^ value);
}
member Insulation : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The id is not a conductor insulation material id nor invalidElementId.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
WireType Class
Autodesk.Revit.DB.Electrical Namespace